K6/testdata/register/ER-data/testcase-remove-fmva/prep.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.altinn.no/services/Register/ER/2013/06">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:SubmitERDataBasic>
        <ns:systemUserName>${soapErUsername}</ns:systemUserName>
        <ns:systemPassword>${soapErPassword}</ns:systemPassword>
            <ns:ERData><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
        <batchAjourholdXML>
            <head avsender="ER" dato="20260512" kjoerenr="00225" mottaker="ALT" type="A" />
            <enhet organisasjonsnummer="316289223" organisasjonsform="BEDR" hovedsakstype="N" undersakstype="NY" foersteOverfoering="J" datoFoedt="20200101" datoSistEndret="20260512">
                <infotype felttype="NAVN" endringstype="N">
                    <navn1>ER SYNC BEDR</navn1>
                    <rednavn>ER SYNC BEDR</rednavn>
                </infotype>
                <infotype felttype="FADR" endringstype="N">
                    <postnr>0150</postnr>
                    <landkode>NO</landkode>
                    <kommunenr>0301</kommunenr>
                    <adresse1>Testveien 10</adresse1>
                </infotype>
                <infotype felttype="FMVA" endringstype="N">
                    <opplysning>BFLA</opplysning>
                </infotype>
                <infotype felttype="TFON" endringstype="N">
                    <opplysning>22334466</opplysning>
                </infotype>
                <samendringer data="D" felttype="KNYT" endringstype="N" type="V">
                    <rolleFratraadt>N</rolleFratraadt>
                    <rolleRekkefoelge>1</rolleRekkefoelge>
                    <rolleOrganisasjonsnr>316289215</rolleOrganisasjonsnr>
                </samendringer>
            </enhet>
            <trai antallEnheter="1" avsender="ER" />
        </batchAjourholdXML>]]></ns:ERData>
        </ns:SubmitERDataBasic>
    </soapenv:Body>
</soapenv:Envelope>
